ams/src/InformationRegisters/ДатаМобайл_УчетКМ/ДатаМобайл_УчетКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаМобайл_УчетКМ</name>
  <resources>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьДокументТСД</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ДокументыТСД</types>
    </type>
  </resources>
  <dimensions>
    <name>УпаковочныйЛист</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦРПТМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТСД</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ДокументыТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьКМ</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/ДатаМобайл_УчетКМ/ManagerModule.bsl
Функция ЕстьЗаписиВРегистре(Шаблон) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДатаМобайл_УчетКМ.ДокументТСД КАК ДокументТСД
	|ИЗ
	|	РегистрСведений.ДатаМобайл_УчетКМ КАК ДатаМобайл_УчетКМ";
	Результат = Запрос.Выполнить();
	
	СтруктураОтвета.Вставить("РегистрПустой", Результат.Пустой()); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДатаМобайл_УчетКМ.ДокументТСД КАК ДокументТСД
	|ИЗ
	|	РегистрСведений.ДатаМобайл_УчетКМ КАК ДатаМобайл_УчетКМ
	|ГДЕ
	|	ДатаМобайл_УчетКМ.ДокументТСД.Шаблон = &Шаблон";
	Запрос.УстановитьПараметр("Шаблон", Шаблон);  
	
	Результат = Запрос.Выполнить();
	
	СтруктураОтвета.Вставить("ЕстьЗаписиПоШаблону", Не Результат.Пустой());
		 
	Возврат СтруктураОтвета;
	
КонецФункции

Процедура ЗарегистрироватьДанные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ     
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист КАК УпаковочныйЛист,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЦРПТМарка КАК ЦРПТМарка,    
	|	МАКСИМУМ(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка) КАК ДокументТСД,
	|	МАКСИМУМ(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка.ИсходныйДокумент) КАК ИсходныйДокумент,
	|	&ТекущаяДата КАК Дата
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор
	|ГДЕ
	|	НЕ ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЦРПТМарка = &ПустоеЗначение
	|	И НЕ ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист,
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЦРПТМарка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Количество) > 0"; 
	
	Запрос.УстановитьПараметр("ПустоеЗначение", "");
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаМобайл_ОбщийМодуль.ПолучитьТекущуюДату());
	
	НаборЗаписей = РегистрыСведений.ДатаМобайл_УчетКМ.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
	    НаборЗаписей.Записать(Истина);
		Сообщить("Регистрация данных в регистр ""Учет КМ"" завершена!");
	Исключение
	 	ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(1, "ЗарегистрироватьДанные", ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	

Процедура ОчиститьЗаписиШаблона(Шаблон) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_УчетКМ.УпаковочныйЛист,
	|	ДатаМобайл_УчетКМ.ЦРПТМарка,
	|	ДатаМобайл_УчетКМ.ДокументТСД,
	|	ДатаМобайл_УчетКМ.Дата,
	|	ДатаМобайл_УчетКМ.ИсходныйДокумент,
	|	ДатаМобайл_УчетКМ.УдалитьДокументТСД
	|ИЗ
	|	РегистрСведений.ДатаМобайл_УчетКМ КАК ДатаМобайл_УчетКМ
	|ГДЕ
	|	НЕ ДатаМобайл_УчетКМ.ДокументТСД.Шаблон = &Шаблон";
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	НаборЗаписей = РегистрыСведений.ДатаМобайл_УчетКМ.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
		НаборЗаписей.Записать(Истина);	
	Исключение
		ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ОчиститьЗаписиРегистраУчетКМ", ОписаниеОшибки());     
	КонецПопытки;			
	
КонецПроцедуры

Процедура ОчиститьЗаписиДокумента(ДокументТСД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_УчетКМ.УпаковочныйЛист,
	|	ДатаМобайл_УчетКМ.ЦРПТМарка,
	|	ДатаМобайл_УчетКМ.ДокументТСД,
	|	ДатаМобайл_УчетКМ.Дата,
	|	ДатаМобайл_УчетКМ.ИсходныйДокумент,
	|	ДатаМобайл_УчетКМ.УдалитьДокументТСД
	|ИЗ
	|	РегистрСведений.ДатаМобайл_УчетКМ КАК ДатаМобайл_УчетКМ
	|ГДЕ
	|	НЕ ДатаМобайл_УчетКМ.ДокументТСД = &ДокументТСД";
	Запрос.УстановитьПараметр("ДокументТСД", ДокументТСД);
	
	НаборЗаписей = РегистрыСведений.ДатаМобайл_УчетКМ.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
		НаборЗаписей.Записать(Истина);	
	Исключение
		ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ОчиститьЗаписиДокумента", ОписаниеОшибки());     
	КонецПопытки;
			
КонецПроцедуры

Процедура ДобавитьЗапись(Параметры) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДатаМобайл_УчетКМ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ЦРПТМарка.Установить(Параметры.ЦРПТМарка);
	НаборЗаписей.Отбор.УпаковочныйЛист.Установить(Параметры.УпаковочныйЛист);
    НаборЗаписей.Отбор.ДокументТСД.Установить(Параметры.ДокументТСД);

	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.УпаковочныйЛист =  Параметры.УпаковочныйЛист;
	НоваяЗапись.ЦРПТМарка = Параметры.ЦРПТМарка;
	НоваяЗапись.ДокументТСД = Параметры.ДокументТСД;
	НоваяЗапись.Дата = Параметры.Дата;
	НоваяЗапись.ИсходныйДокумент = Параметры.ИсходныйДокумент;
	Попытка
		НаборЗаписей.Записать(Истина);	
	Исключение
		ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ДобавитьЗапись", ОписаниеОшибки());     
	КонецПопытки; 
	
КонецПроцедуры
		
Процедура ОтменитьЗапись(Параметры) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДатаМобайл_УчетКМ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ЦРПТМарка.Установить(Параметры.ЦРПТМарка);
	НаборЗаписей.Отбор.УпаковочныйЛист.Установить(Параметры.УпаковочныйЛист);
    НаборЗаписей.Отбор.ДокументТСД.Установить(Параметры.ДокументТСД);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
		
	Попытка
		НаборЗаписей.Записать(Истина);	
	Исключение
		ДатаМобайл_ОбщийМодуль.ОбработатьИсключение(0, "ОтменитьЗапись", ОписаниеОшибки());     
	КонецПопытки; 
			
КонецПроцедуры
